# E-commerce Analytics - Brazilian E-Commerce Public Dataset by Olist
# Introduction
This is the first step of the SQL course final project of which its goal is to design and build a sql database (postgresql) in an online IDE called Codio, populate data into the database, doing business intelligence analytics with data visualization and key metrics. The metadata used is retreived from Kaggle, of which the title is "Brazilian E-Commerce Public Dataset by Olist - 100,000 Orders with product, customer and reviews info". The link is https://www.kaggle.com/olistbr/brazilian-ecommerce#olist_orders_dataset.csv.
# Steps
## 1. import packages and raw datasets after sampling
Since the Codio box has 50MB limitation on the size of each single data file, we randomly sample the "customers" dataset to get 50% of the rows (now 49720 rows), and sample the "geolocation" dataset to get 20% of the rows (now 200033 rows).
## 2. connect to the postgresql database
## 3. create the database schema
## 4. extract, transform, and load data into tables
   - (1) Select, rename, change the order of the columns.
   - (2) Merge raw datasets together to get the information needed for each table.
   - (3) Delete duplicated rows
   - (4) Make sure the primary key column is the unique identifier of this table. (The variable should only include unique values).
        - If there are duplicated rows in the primary key column or in any important columns supposed to be unique, we take a deeper look at the duplicates and other variables and then decide based on the situation.
        - For example, (1) after examining the duplicated rows in the reviews dataset, we find that one review_id would link to different oder_id with different information in other columns. We then set both review_id and order_id as the composite primary key. (2) After checking the duplicates in customers table and address table, we find that in the dataset one zip_code_prefix linked to two rows of the same state and city but in two different language. We then delete the duplicated rows. 
   - (5) Construct the "id" if the dataset does not have one.
   - (6) If the table exists foreign keys, we need to merge the current dataset with the dataset referred to by this key to get the intersection. Drop unnecessary variables and rename columns after merging.
        - This step is to ensure that those two tables are linked to each other. 
   - (7) Change the data type of the variable of the raw dataset to stay consistent with the column data type we designed. 
        - For example, we adjust the "product_name_length", "product_description_length", "product_photos_qty" from float to integer. 
   - (8) Reset the table constraints like NULL after examining the cleaned dataset; Reset the variable data type if necessary according to the data we have.
   - (9) Follow the database schema design and load data into the database one by one.

In [1]:
#import packages
import pandas as pd
from sqlalchemy import create_engine
import numpy as np

In [2]:
#import datasets (csv files)
customers = pd.read_csv('customers_new.csv')
geolocation = pd.read_csv('geolocation_new.csv')
sellers = pd.read_csv('olist_sellers_dataset.csv')

In [3]:
order_items = pd.read_csv('olist_order_items_dataset.csv')
payments = pd.read_csv('olist_order_payments_dataset.csv')
reviews = pd.read_csv('olist_order_reviews_dataset.csv')
orders = pd.read_csv('olist_orders_dataset.csv')
products = pd.read_csv('olist_products_dataset.csv')
product_category = pd.read_csv('product_category_name_translation.csv')

# Create Database Tables

In [4]:
# Pass the connection string to a variable, conn_url
conn_url = 'postgresql://postgres:pwd4APAN5310@35.237.178.81/ecommerce'

# Create an engine that connects to PostgreSQL server
engine = create_engine(conn_url)

# Establish a connection
connection = engine.connect()

In [ ]:
# Pass the SQL statements that create all tables
stmt = """
CREATE TABLE address(
geolocation_id      varchar(10),
zip_code_prefix    varchar(10) NOT NULL,
geolocation_city    varchar(50) NOT NULL,
geolocation_state  varchar(50) NOT NULL,
PRIMARY KEY (geolocation_id));

CREATE TABLE customers(
customer_id                    varchar(35),
customer_unique_id       varchar(35) NOT NULL,
geolocation_id varchar(10) NOT NULL,
PRIMARY KEY (customer_id),
FOREIGN KEY (geolocation_id) REFERENCES address (geolocation_id)
);
      
CREATE TABLE sellers(
seller_id           varchar(35),
geolocation_id varchar(10) NOT NULL,
PRIMARY KEY (seller_id),
FOREIGN KEY (geolocation_id) REFERENCES address (geolocation_id)
);
     
CREATE TABLE product_category(
product_category_id                    varchar(10),
product_category_name_english varchar(100) NOT NULL,
PRIMARY KEY (product_category_id)
);
       
CREATE TABLE product(
product_id                            varchar(35),
product_name_length          smallint NOT NULL,
product_description_length  smallint NOT NULL,
product_photos_qty             smallint NOT NULL,
product_category_id            varchar(10) NOT NULL,
product_weight                    numeric(6,2) NOT NULL,
product_length                     numeric(6,2) NOT NULL,
product_height                     numeric(6,2) NOT NULL,
product_width                       numeric(6,2) NOT NULL,                     
PRIMARY KEY (product_id),
FOREIGN KEY (product_category_id)  REFERENCES product_category(product_category_id)
);
       
CREATE TABLE orders(
order_id        varchar (35),
customer_id  varchar (35) NOT NULL,
order_purchase_timestamp timestamp NOT NULL,
PRIMARY KEY (order_id),
FOREIGN KEY (customer_id) REFERENCES customers (customer_id)
);

CREATE TABLE products_ordered(
order_id     varchar(35),
product_id varchar(35),
seller_id     varchar(35) NOT NULL,
item_price  numeric(9,2) NOT NULL,
order_freight_value              numeric(6,2) NOT NULL,
PRIMARY KEY (order_id, product_id),
FOREIGN KEY (order_id) REFERENCES orders (order_id),
FOREIGN KEY (product_id) REFERENCES product (product_id), 
FOREIGN KEY (seller_id) REFERENCES sellers (seller_id)
);

CREATE TABLE delivery(
delivery_id                varchar(35),
order_id                   varchar (35) NOT NULL,
order_status               varchar (20) CHECK (order_status IN ('delivered', 'invoiced', 'shipped', 'processing', 'unavailable',
                       'canceled', 'created', 'approved')),
order_approved_at             timestamp NOT NULL,
order_delivered_carrier_date  timestamp NOT NULL,
order_estimated_delivery_date timestamp NOT NULL,
order_delivered_customer_date timestamp NOT NULL,
PRIMARY KEY (delivery_id),
FOREIGN KEY (order_id) REFERENCES orders (order_id)
);

CREATE TABLE reviews(
review_id                         varchar(20),
order_id                          varchar(35) NOT NULL,
review_score                      varchar(1) 
                                  CHECK (review_score IN ('1','2','3','4','5')),
review_comment_title          varchar(100),
review_comment_message        varchar(10000),
review_creation_date          timestamp NOT NULL,
review_answer_timestamp       timestamp NOT NULL,
PRIMARY KEY (review_id, order_id),
FOREIGN KEY (order_id) REFERENCES orders(order_id)
);

CREATE TABLE payment(
payment_id     varchar(35),
order_id          varchar (35) NOT NULL,
installments    smallint NOT NULL,
sequential      smallint NOT NULL,
payment_type varchar(25) 
                      CHECK (payment_type IN ('credit_card', 'boleto', 'voucher', 'debit_card', 'not_defined')),
transaction_value numeric(9,2) NOT NULL,
PRIMARY KEY (payment_id),
FOREIGN KEY (order_id) REFERENCES orders (order_id)
);
"""

# Execute the statement to create tables
connection.execute(stmt)

During the data cleaning process, we find that some settings of the tables are not appropriate for the data we have currently. For example, the dimensions measures of products only contain 1 decimal digit, and some of them have NAs in these columns. The timestamp type variables like "order_approved_at" and else of the delivery table have NULL entries. The review_id is longer than 20 characters. Thus, we need to update the constraints or data types of variables.

In [ ]:
stmt = """
ALTER TABLE product
    ALTER COLUMN product_weight TYPE numeric(6,1),
    ALTER COLUMN product_length TYPE numeric(6,1),
    ALTER COLUMN product_height TYPE numeric(6,1),
    ALTER COLUMN product_width TYPE numeric(6,1);
    
ALTER TABLE product 
    ALTER COLUMN product_weight DROP NOT NULL,
    ALTER COLUMN product_length DROP NOT NULL,
    ALTER COLUMN product_height DROP NOT NULL,
    ALTER COLUMN product_width DROP NOT NULL;

ALTER TABLE delivery 
    ALTER COLUMN order_approved_at DROP NOT NULL,
    ALTER COLUMN order_delivered_carrier_date DROP NOT NULL,
    ALTER COLUMN order_estimated_delivery_date DROP NOT NULL,
    ALTER COLUMN order_delivered_customer_date DROP NOT NULL;
 
ALTER TABLE reviews 
    ALTER COLUMN review_id TYPE varchar(50),
    ALTER COLUMN review_score TYPE integer;
"""

# Execute the statement
connection.execute(stmt)

# Extract, Transform and Load

## Geolocation - Address

As is seen in the design of the database schema, "address" is the first table to construct. Thus, it is necessary to first check the geolocation dataset and perform necessary transformation.

In [15]:
#check the dataset
geolocation.head()

,Unnamed: 0,geolocation_zip_code_prefix,geolocation_lat,geolocation_lng,geolocation_city,geolocation_state
0,540514,29830,-18.712268,-40.408375,nova venecia,ES
1,257682,11609,-23.802964,-45.405801,são sebastião,SP
2,506728,27535,-22.454129,-44.438455,resende,RJ
3,398506,19020,-22.115151,-51.382460,presidente prudente,SP
4,302194,13390,-22.852808,-47.615387,rio das pedras,SP

In [16]:
geolocation.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 200033 entries, 0 to 200032
Data columns (total 6 columns):
Unnamed: 0                     200033 non-null int64
geolocation_zip_code_prefix    200033 non-null int64
geolocation_lat                200033 non-null float64
geolocation_lng                200033 non-null float64
geolocation_city               200033 non-null object
geolocation_state              200033 non-null object
dtypes: float64(2), int64(2), object(2)
memory usage: 9.2+ MB

"Geolocation" dataset does not have null values. Also, it is a well-constructed dataset with information we need including zip code, longitude, latitude, city, and state. Then we need to check the duplicates, construct the unique  "geolocation_id" as the primary key, adjust the column names and the order.

In [18]:
geo_df = geolocation.drop_duplicates() #drop duplicated rows to get the unique rows
len(geo_df)

200033

In [19]:
geo_data = geo_df[['geolocation_zip_code_prefix', 'geolocation_city', 'geolocation_state']].copy()

In [20]:
#rename the columns to make it consistent with the "address" table
geo_data.columns = ['zip_code_prefix', 'geolocation_city', 'geolocation_state']

In [21]:
geo_data.drop_duplicates(['zip_code_prefix'],inplace = True) #drop duplicates
geo_data.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 16728 entries, 0 to 199953
Data columns (total 3 columns):
zip_code_prefix      16728 non-null int64
geolocation_city     16728 non-null object
geolocation_state    16728 non-null object
dtypes: int64(1), object(2)
memory usage: 522.8+ KB

In [22]:
len(geo_data['zip_code_prefix'].unique()) == len(geo_data['zip_code_prefix']) #make sure the each zip code links to one entry

True

In [23]:
#construct the "geolocation_id"
geo_data.insert(0, 'geolocation_id', range(1, 1+len(geo_data)))

In [24]:
#change the order of the columns to make it consistent with the "address" table
geo_data = geo_data[['geolocation_id', 'zip_code_prefix', 'geolocation_city', 'geolocation_state']]

In [25]:
geo_data.head()

   geolocation_id  zip_code_prefix     geolocation_city geolocation_state
0               1            29830         nova venecia                ES
1               2            11609        são sebastião                SP
2               3            27535              resende                RJ
3               4            19020  presidente prudente                SP
4               5            13390       rio das pedras                SP

In [18]:
#Load the table into sql
geo_data.to_sql(name='address', con=engine, if_exists='append', index=False)

## Customers

The second table is "customers" of which the information comes from the customers dataset.

In [26]:
customers.head()

,Unnamed: 0,customer_id,customer_unique_id,customer_zip_code_prefix,customer_city,customer_state
0,8470,d2097ad5b2a41f250574fcb77d7515cd,d43ff2e3bd83098a3c77f36a565ea47e,13075,campinas,SP
1,25456,fb9905dff73be7499c32a25c99961503,b80112b1a24982f7eecdaa9e06af98f9,13015,campinas,SP
2,34997,13d44a48280d6bd29ffbbf23c3680afc,d67aa1ce7cabb93451a2795dcea925ab,4857,sao paulo,SP
3,12824,2f751d53058e28b3d51ad54852cc9c5e,44d111bdc55faca551ef91cb74a444d8,3572,sao paulo,SP
4,45150,425303cf0383f08e3aeac0ef4f6dac7e,3f83cc6482add73101d5d76634baca96,23560,rio de janeiro,RJ

In [27]:
customers.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 49720 entries, 0 to 49719
Data columns (total 6 columns):
Unnamed: 0                  49720 non-null int64
customer_id                 49720 non-null object
customer_unique_id          49720 non-null object
customer_zip_code_prefix    49720 non-null int64
customer_city               49720 non-null object
customer_state              49720 non-null object
dtypes: int64(2), object(4)
memory usage: 2.3+ MB

In [28]:
customers = customers[['customer_id', 'customer_unique_id', 
                       'customer_zip_code_prefix', 'customer_city', 'customer_state']] #drop the unnamed

In [29]:
t_customer = customers[['customer_id']] #get the customer id

In [30]:
len(t_customer)==len(t_customer['customer_id'].unique()) #check whether the customer_id contains only unique value

True

In [31]:
#address and customers table should be linked to each other. 
#"Geolocation_id" will be the foreign key referencing the address table, which should be added to the dataset.
#Merge two tables together by zipcode using Inner Join.
temp_customers = customers.merge(geo_data, left_on= customers['customer_zip_code_prefix'], 
                                 right_on = geo_data['zip_code_prefix'], how = 'inner')

In [33]:
#Pick the 3 variables for this table
customers_df = temp_customers[['customer_id', 'customer_unique_id', 'geolocation_id']]

In [34]:
customers_df.head()

,customer_id,customer_unique_id,geolocation_id
0,d2097ad5b2a41f250574fcb77d7515cd,d43ff2e3bd83098a3c77f36a565ea47e,7987
1,b63d3a810558af5af7ab6261494da135,1c813c1e37d1febb85d0d06d4c7ccc7c,7987
2,fb9905dff73be7499c32a25c99961503,b80112b1a24982f7eecdaa9e06af98f9,188
3,62b928147854bc65eeeff14bb787a009,7059102c8d28a87a84e645a7e6784fc4,188
4,b3d94a7947f1b122459d6494760708e8,f0ac405c280fab1d087b8982e7801b54,188

In [35]:
len(customers_df)==len(customers_df['customer_id'].unique()) #double check the primary key

True

In [25]:
customers_df.to_sql(name='customers', con=engine, if_exists='append', index=False)

## Sellers

In [36]:
sellers.head()

,seller_id,seller_zip_code_prefix,seller_city,seller_state
0,3442f8959a84dea7ee197c632cb2df15,13023,campinas,SP
1,d1b65fc7debc3361ea86b5f14c68d2e2,13844,mogi guacu,SP
2,ce3ad9de960102d0677a81f5d0bb7b2d,20031,rio de janeiro,RJ
3,c0f3eea2e14555b6faeea3dd58c1b1c3,4195,sao paulo,SP
4,51a04a8a6bdcb23deccc82b0b80742cf,12914,braganca paulista,SP

In [37]:
#address and sellers table should be linked to each other. 
#"Geolocation_id" will be the foreign key referencing the address table, which should be added to the dataset.
#Merge two tables together by zipcode using Inner Join.
temp_sellers = sellers.merge(geo_data, left_on= sellers['seller_zip_code_prefix'], 
                             right_on = geo_data['zip_code_prefix'], how = 'inner')

In [38]:
#pick two variables
sellers_df = temp_sellers[['seller_id', 'geolocation_id']]
sellers_df['geolocation_id'].unique()

array([ 1016,  4789,   207, ...,  6349,   392, 11119])

In [39]:
sellers_df.head()

                          seller_id  geolocation_id
0  3442f8959a84dea7ee197c632cb2df15            1016
1  e0eabded302882513ced4ea3eb0c7059            1016
2  d1b65fc7debc3361ea86b5f14c68d2e2            4789
3  ce3ad9de960102d0677a81f5d0bb7b2d             207
4  1d2732ef8321502ee8488e8bed1ab8cd             207

In [40]:
len(sellers_df)==len(sellers_df['seller_id'].unique()) #make sure that the seller_id only contains unique values

True

In [30]:
sellers_df.to_sql(name='sellers', con=engine, if_exists='append', index=False)

## Product Category

Before diving deep into the products dataset, it is critical to transform the product category dataset and add the product_category_id column.

In [27]:
product_category.head() #each row only contains one term (e.g. "health_beauty" means one category)

    product_category_name product_category_name_english
0            beleza_saude                 health_beauty
1  informatica_acessorios         computers_accessories
2              automotivo                          auto
3         cama_mesa_banho                bed_bath_table
4        moveis_decoracao               furniture_decor

In [24]:
category_df = product_category.drop_duplicates() #drop duplicate rows
len(category_df)

71

In [25]:
#pick the id and english name column and save it as a new dataframe
category = category_df[['product_category_name_english']] 
category.head()

  product_category_name_english
0                 health_beauty
1         computers_accessories
2                          auto
3                bed_bath_table
4               furniture_decor

In [26]:
category.insert(0, 'product_category_id', range(1, 1+len(category))) #construct the id column for product category

In [27]:
category.head()

   product_category_id product_category_name_english
0                    1                 health_beauty
1                    2         computers_accessories
2                    3                          auto
3                    4                bed_bath_table
4                    5               furniture_decor

In [49]:
category.to_sql(name='product_category', con=engine, if_exists='append', index=False)

## Products

In [37]:
products.head()

,product_id,product_category_name,product_name_lenght,product_description_lenght,product_photos_qty,product_weight_g,product_length_cm,product_height_cm,product_width_cm
0,1e9e8ef04dbcff4541ed26657ea517e5,perfumaria,40.0,287.0,1.0,225.0,16.0,10.0,14.0
1,3aa071139cb16b67ca9e5dea641aaa2f,artes,44.0,276.0,1.0,1000.0,30.0,18.0,20.0
2,96bd76ec8810374ed1b65e291975717f,esporte_lazer,46.0,250.0,1.0,154.0,18.0,9.0,15.0
3,cef67bcfe19066a932b7673e239eb23d,bebes,27.0,261.0,1.0,371.0,26.0,4.0,26.0
4,9dc1a7de274444849c219cff195d0b71,utilidades_domesticas,37.0,402.0,4.0,625.0,20.0,17.0,13.0

The products dataset is supposed to include the "product_category_id". It is thus necessary to merge product category dataset with the original products dataset by the product category name.

In [38]:
#merge the original product category dataset and products datasets by product category name
products_temp = products.merge(category_df, left_on = products['product_category_name'], 
                             right_on = category_df['product_category_name'], how = 'left')

In [39]:
products_temp.head()

,product_id,product_category_name_x,product_name_lenght,product_description_lenght,product_photos_qty,product_weight_g,product_length_cm,product_height_cm,product_width_cm,product_category_name_y,product_category_name_english
0,1e9e8ef04dbcff4541ed26657ea517e5,perfumaria,40.0,287.0,1.0,225.0,16.0,10.0,14.0,perfumaria,perfumery
1,3aa071139cb16b67ca9e5dea641aaa2f,artes,44.0,276.0,1.0,1000.0,30.0,18.0,20.0,artes,art
2,96bd76ec8810374ed1b65e291975717f,esporte_lazer,46.0,250.0,1.0,154.0,18.0,9.0,15.0,esporte_lazer,sports_leisure
3,cef67bcfe19066a932b7673e239eb23d,bebes,27.0,261.0,1.0,371.0,26.0,4.0,26.0,bebes,baby
4,9dc1a7de274444849c219cff195d0b71,utilidades_domesticas,37.0,402.0,4.0,625.0,20.0,17.0,13.0,utilidades_domesticas,housewares

In [40]:
#merge the datasets to get the product_category_id
products_df = products_temp.merge(category, left_on = products_temp['product_category_name_english'], 
                                 right_on = category['product_category_name_english'], how = 'inner')
products_df.head()

,product_id,product_category_name_x,product_name_lenght,product_description_lenght,product_photos_qty,product_weight_g,product_length_cm,product_height_cm,product_width_cm,product_category_name_y,product_category_name_english_x,product_category_id,product_category_name_english_y
0,1e9e8ef04dbcff4541ed26657ea517e5,perfumaria,40.0,287.0,1.0,225.0,16.0,10.0,14.0,perfumaria,perfumery,7,perfumery
1,6a2fb4dd53d2cdb88e0432f1284a004c,perfumaria,39.0,346.0,2.0,400.0,27.0,5.0,20.0,perfumaria,perfumery,7,perfumery
2,0d009643171aee696f4733340bc2fdd0,perfumaria,52.0,150.0,1.0,422.0,21.0,16.0,18.0,perfumaria,perfumery,7,perfumery
3,b1eae565a61935e0011ee7682fef9dc9,perfumaria,49.0,460.0,2.0,267.0,17.0,13.0,17.0,perfumaria,perfumery,7,perfumery
4,8da90b37f0fb171b4877c124f965b1f6,perfumaria,56.0,733.0,3.0,377.0,18.0,13.0,15.0,perfumaria,perfumery,7,perfumery

In [41]:
#drop unnecessary columns
products_df.drop(['product_category_name_x','product_category_name_y', 'product_category_name_english_x', 'product_category_name_english_y'],axis = 1, inplace = True)
products_df.head()

,product_id,product_name_lenght,product_description_lenght,product_photos_qty,product_weight_g,product_length_cm,product_height_cm,product_width_cm,product_category_id
0,1e9e8ef04dbcff4541ed26657ea517e5,40.0,287.0,1.0,225.0,16.0,10.0,14.0,7
1,6a2fb4dd53d2cdb88e0432f1284a004c,39.0,346.0,2.0,400.0,27.0,5.0,20.0,7
2,0d009643171aee696f4733340bc2fdd0,52.0,150.0,1.0,422.0,21.0,16.0,18.0,7
3,b1eae565a61935e0011ee7682fef9dc9,49.0,460.0,2.0,267.0,17.0,13.0,17.0,7
4,8da90b37f0fb171b4877c124f965b1f6,56.0,733.0,3.0,377.0,18.0,13.0,15.0,7

In [42]:
#rename the columns
products_df.columns = ['product_id', 'product_name_length', 'product_description_length', 'product_photos_qty',
                       'product_weight', 'product_length', 'product_height', 'product_width', 'product_category_id']
#check the dataframe
products_df.head()

,product_id,product_name_length,product_description_length,product_photos_qty,product_weight,product_length,product_height,product_width,product_category_id
0,1e9e8ef04dbcff4541ed26657ea517e5,40.0,287.0,1.0,225.0,16.0,10.0,14.0,7
1,6a2fb4dd53d2cdb88e0432f1284a004c,39.0,346.0,2.0,400.0,27.0,5.0,20.0,7
2,0d009643171aee696f4733340bc2fdd0,52.0,150.0,1.0,422.0,21.0,16.0,18.0,7
3,b1eae565a61935e0011ee7682fef9dc9,49.0,460.0,2.0,267.0,17.0,13.0,17.0,7
4,8da90b37f0fb171b4877c124f965b1f6,56.0,733.0,3.0,377.0,18.0,13.0,15.0,7

In [43]:
#drop duplicates and save the results as the new dataframe
products_df_2 = products_df.drop_duplicates()
#check the number of rows
len(products_df_2)

32328

In [44]:
len(products_df_2)==len(products_df_2['product_id'].unique()) #make sure product_id only contains unique value and uniquely identifies rows

True

In [45]:
products_df_2 = products_df_2[['product_id', 'product_name_length', 'product_description_length', 
                               'product_photos_qty','product_category_id', 
                               'product_weight', 'product_length', 'product_height', 'product_width']]
#change the order

In [46]:
#change the data type from float to integer
for name in ['product_name_length', 'product_description_length', 'product_photos_qty']:
    products_df_2[name] = products_df_2[name].apply(lambda x:int(x))

In [47]:
products_df_2.head()

,product_id,product_name_length,product_description_length,product_photos_qty,product_category_id,product_weight,product_length,product_height,product_width
0,1e9e8ef04dbcff4541ed26657ea517e5,40,287,1,7,225.0,16.0,10.0,14.0
1,6a2fb4dd53d2cdb88e0432f1284a004c,39,346,2,7,400.0,27.0,5.0,20.0
2,0d009643171aee696f4733340bc2fdd0,52,150,1,7,422.0,21.0,16.0,18.0
3,b1eae565a61935e0011ee7682fef9dc9,49,460,2,7,267.0,17.0,13.0,17.0
4,8da90b37f0fb171b4877c124f965b1f6,56,733,3,7,377.0,18.0,13.0,15.0

In [40]:
#load the dataframe into sql database
products_df_2.to_sql(name='product', con=engine, if_exists='append', index=False)

## Orders

It is critical to point out that one order might include multiple products, meaning that the customer purchased multiple products in one order. Orders and Products tables are the many-to-many relationship. In order to reduce the database redundancy, we construct a "products_ordered" table including the order_id and product_id, which helps link orders and products table together.

In [48]:
orders.head()

,order_id,customer_id,order_status,order_purchase_timestamp,order_approved_at,order_delivered_carrier_date,order_delivered_customer_date,order_estimated_delivery_date
0,e481f51cbdc54678b7cc49136f2d6af7,9ef432eb6251297304e76186b10a928d,delivered,2017-10-02 10:56:33,2017-10-02 11:07:15,2017-10-04 19:55:00,2017-10-10 21:25:13,2017-10-18 00:00:00
1,53cdb2fc8bc7dce0b6741e2150273451,b0830fb4747a6c6d20dea0b8c802d7ef,delivered,2018-07-24 20:41:37,2018-07-26 03:24:27,2018-07-26 14:31:00,2018-08-07 15:27:45,2018-08-13 00:00:00
2,47770eb9100c2d0c44946d9cf07ec65d,41ce2a54c0b03bf3443c3d931a367089,delivered,2018-08-08 08:38:49,2018-08-08 08:55:23,2018-08-08 13:50:00,2018-08-17 18:06:29,2018-09-04 00:00:00
3,949d5b44dbf5de918fe9c16f97b45f8a,f88197465ea7920adcdbec7375364d82,delivered,2017-11-18 19:28:06,2017-11-18 19:45:59,2017-11-22 13:39:59,2017-12-02 00:28:42,2017-12-15 00:00:00
4,ad21c59c0840e6cb83a9ceb5573f8159,8ab97904e6daea8866dbdbc4fb7aad2c,delivered,2018-02-13 21:18:39,2018-02-13 22:20:29,2018-02-14 19:46:34,2018-02-16 18:17:02,2018-02-26 00:00:00

In [49]:
orders.shape

(99441, 8)

In [50]:
order = orders.drop_duplicates() #drop the duplicates and check the number of duplicates
len(order) #We find that the orders dataset does not have duplicated rows

99441

The "order_items" dataset has already linked the orders with the products.

In [51]:
order_items.head() #we need to check another dataset "order_items"

,order_id,order_item_id,product_id,seller_id,price,freight_value
0,00010242fe8c5a6d1ba2dd792cb16214,1,4244733e06e7ecb4970a6e2683c13e61,48436dade18ac8b2bce089ec2a041202,58.90,13.29
1,00018f77f2f0320c557190d7a144bdd3,1,e5f2d52b802189ee658865ca93d83a8f,dd7ddc04e1b6c2c614352b383efe2d36,239.90,19.93
2,000229ec398224ef6ca0657da4fc703e,1,c777355d18b72b67abbeef9df44fd0fd,5b51032eddd242adc84c38acab88f23d,199.00,17.87
3,00024acbcdf0a6daa1e931b038114c75,1,7634da152a4610f1595efa32f14722fc,9d7a1d34a5052409006425275ba1c2b4,12.99,12.79
4,00042b26cf59d7ce69dfabb4e55b4fd9,1,ac6c3623068f30de03045865e4e10089,df560393f3a51e74553ab94004ba5c87,199.90,18.14

In [52]:
order_items.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 112650 entries, 0 to 112649
Data columns (total 6 columns):
order_id         112650 non-null object
order_item_id    112650 non-null int64
product_id       112650 non-null object
seller_id        112650 non-null object
price            112650 non-null float64
freight_value    112650 non-null float64
dtypes: float64(2), int64(1), object(3)
memory usage: 5.2+ MB

In [5]:
order_items = order_items.drop_duplicates() #drop duplicate entries
len(order_items)

112650

In [6]:
#Merge order dataset with order_items dataset by order_id
order = order_items.merge(orders, left_on = order_items['order_id'], 
                          right_on = orders['order_id'], 
                          how = 'inner')
#drop unnecessary columns that will be included in the delivery table
order.drop(['order_status', 'order_id_y','order_approved_at', 'order_delivered_carrier_date', 
                   'order_estimated_delivery_date', 'order_delivered_customer_date'], axis = 1, inplace = True)
#check the order dataframe
order.head()

,order_id_x,order_item_id,product_id,seller_id,price,freight_value,customer_id,order_purchase_timestamp
0,00010242fe8c5a6d1ba2dd792cb16214,1,4244733e06e7ecb4970a6e2683c13e61,48436dade18ac8b2bce089ec2a041202,58.90,13.29,3ce436f183e68e07877b285a838db11a,2017-09-13 08:59:02
1,00018f77f2f0320c557190d7a144bdd3,1,e5f2d52b802189ee658865ca93d83a8f,dd7ddc04e1b6c2c614352b383efe2d36,239.90,19.93,f6dd3ec061db4e3987629fe6b26e5cce,2017-04-26 10:53:06
2,000229ec398224ef6ca0657da4fc703e,1,c777355d18b72b67abbeef9df44fd0fd,5b51032eddd242adc84c38acab88f23d,199.00,17.87,6489ae5e4333f3693df5ad4372dab6d3,2018-01-14 14:33:31
3,00024acbcdf0a6daa1e931b038114c75,1,7634da152a4610f1595efa32f14722fc,9d7a1d34a5052409006425275ba1c2b4,12.99,12.79,d4eb9395c8c0431ee92fce09860c5a06,2018-08-08 10:00:35
4,00042b26cf59d7ce69dfabb4e55b4fd9,1,ac6c3623068f30de03045865e4e10089,df560393f3a51e74553ab94004ba5c87,199.90,18.14,58dbd0b2d70206bf40e62cd34e84d795,2017-02-04 13:57:51

In [7]:
#reorder the dataframe columns and save it into a new order dataframe
order_df = order[['order_id_x', 'customer_id', 'order_purchase_timestamp']].copy()
#rename the columns
order_df.columns = ['order_id', 'customer_id', 'order_purchase_timestamp']
order_df.shape

(112650, 3)

In [8]:
#Drop the duplicated rows in the new order dataframe
order_df_2 = order_df.drop_duplicates()
len(order_df_2) #we find that there are duplicates in the original dataframe

98666

In [9]:
order_df_2.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 98666 entries, 0 to 112649
Data columns (total 3 columns):
order_id                    98666 non-null object
customer_id                 98666 non-null object
order_purchase_timestamp    98666 non-null object
dtypes: object(3)
memory usage: 3.0+ MB

In [10]:
order_df_2[order_df_2['order_id']=='002f98c0f7efd42638ed6100ca699b42']

,order_id,customer_id,order_purchase_timestamp
80,002f98c0f7efd42638ed6100ca699b42,75fd1fb0bb511fc71ac2b2649c02b21b,2017-08-04 09:19:10

In [11]:
len(order_df_2) == len(order_df_2['order_id'].unique()) #make sure the order_id uniquely identifies each row and includes only unique value

True

In [41]:
#Since customer_id is a foreign key, we need to merge the order table with customers table to get the intersection
order_new = order_df_2.merge(customers_df, left_on = order_df_2['customer_id'], 
                          right_on = customers_df['customer_id'], 
                          how = 'inner')
order_new.head()

,order_id,customer_id_x,order_purchase_timestamp,customer_id_y,customer_unique_id,geolocation_id
0,00018f77f2f0320c557190d7a144bdd3,f6dd3ec061db4e3987629fe6b26e5cce,2017-04-26 10:53:06,f6dd3ec061db4e3987629fe6b26e5cce,eb28e67c4c0b83846050ddfb8a35d051,4970
1,000229ec398224ef6ca0657da4fc703e,6489ae5e4333f3693df5ad4372dab6d3,2018-01-14 14:33:31,6489ae5e4333f3693df5ad4372dab6d3,3818d81c6709e39d06b2738a8d3a2474,210
2,00054e8431b9d7675808bcb819fb4a32,32e2e6ab09e778d99bf2e0ecd4898718,2017-12-10 11:53:48,32e2e6ab09e778d99bf2e0ecd4898718,635d9ac1680f03288e72ada3a1035803,1415
3,0005f50442cb953dcd1d21e1fb923495,351d3cb2cee3c7fd0af6616c82df21d3,2018-07-02 13:59:39,351d3cb2cee3c7fd0af6616c82df21d3,0782c41380992a5a533489063df0eef6,8547
4,00063b381e2406b52ad429470734ebd5,6a899e55865de6549a58d2c6845e5604,2018-07-27 17:21:27,6a899e55865de6549a58d2c6845e5604,3fb97204945ca0c01bcf3eee6031c5f1,2453

In [42]:
#drop unnecessary columns that will be included in the delivery table
order_new.drop(['customer_unique_id', 'customer_id_y','geolocation_id'], axis = 1, inplace = True)
#check the order dataframe
order_new.head()

,order_id,customer_id_x,order_purchase_timestamp
0,00018f77f2f0320c557190d7a144bdd3,f6dd3ec061db4e3987629fe6b26e5cce,2017-04-26 10:53:06
1,000229ec398224ef6ca0657da4fc703e,6489ae5e4333f3693df5ad4372dab6d3,2018-01-14 14:33:31
2,00054e8431b9d7675808bcb819fb4a32,32e2e6ab09e778d99bf2e0ecd4898718,2017-12-10 11:53:48
3,0005f50442cb953dcd1d21e1fb923495,351d3cb2cee3c7fd0af6616c82df21d3,2018-07-02 13:59:39
4,00063b381e2406b52ad429470734ebd5,6a899e55865de6549a58d2c6845e5604,2018-07-27 17:21:27

In [43]:
order_new.columns = ['order_id', 'customer_id', 'order_purchase_timestamp'] #rename the columns
order_new.head()

,order_id,customer_id,order_purchase_timestamp
0,00018f77f2f0320c557190d7a144bdd3,f6dd3ec061db4e3987629fe6b26e5cce,2017-04-26 10:53:06
1,000229ec398224ef6ca0657da4fc703e,6489ae5e4333f3693df5ad4372dab6d3,2018-01-14 14:33:31
2,00054e8431b9d7675808bcb819fb4a32,32e2e6ab09e778d99bf2e0ecd4898718,2017-12-10 11:53:48
3,0005f50442cb953dcd1d21e1fb923495,351d3cb2cee3c7fd0af6616c82df21d3,2018-07-02 13:59:39
4,00063b381e2406b52ad429470734ebd5,6a899e55865de6549a58d2c6845e5604,2018-07-27 17:21:27

In [61]:
order_new.to_sql(name='orders', con=engine, if_exists='append', index=False)

## Delivery

The delivery information is all stored in the "orders" table. By selecting the columns out, we are able to construct the delivery table after removing the duplicates if necessary and adding the "delivery_id". But the "delivery" table should be loaded after we load the "orders" table and the "products_ordered" table first.

In [63]:
orders.head()

,order_id,customer_id,order_status,order_purchase_timestamp,order_approved_at,order_delivered_carrier_date,order_delivered_customer_date,order_estimated_delivery_date
0,e481f51cbdc54678b7cc49136f2d6af7,9ef432eb6251297304e76186b10a928d,delivered,2017-10-02 10:56:33,2017-10-02 11:07:15,2017-10-04 19:55:00,2017-10-10 21:25:13,2017-10-18 00:00:00
1,53cdb2fc8bc7dce0b6741e2150273451,b0830fb4747a6c6d20dea0b8c802d7ef,delivered,2018-07-24 20:41:37,2018-07-26 03:24:27,2018-07-26 14:31:00,2018-08-07 15:27:45,2018-08-13 00:00:00
2,47770eb9100c2d0c44946d9cf07ec65d,41ce2a54c0b03bf3443c3d931a367089,delivered,2018-08-08 08:38:49,2018-08-08 08:55:23,2018-08-08 13:50:00,2018-08-17 18:06:29,2018-09-04 00:00:00
3,949d5b44dbf5de918fe9c16f97b45f8a,f88197465ea7920adcdbec7375364d82,delivered,2017-11-18 19:28:06,2017-11-18 19:45:59,2017-11-22 13:39:59,2017-12-02 00:28:42,2017-12-15 00:00:00
4,ad21c59c0840e6cb83a9ceb5573f8159,8ab97904e6daea8866dbdbc4fb7aad2c,delivered,2018-02-13 21:18:39,2018-02-13 22:20:29,2018-02-14 19:46:34,2018-02-16 18:17:02,2018-02-26 00:00:00

In [64]:
delivery = orders[['order_id', 'order_status', 'order_approved_at', 'order_delivered_carrier_date', 
                   'order_estimated_delivery_date', 'order_delivered_customer_date']] #pick the variables
delivery.head()

,order_id,order_status,order_approved_at,order_delivered_carrier_date,order_estimated_delivery_date,order_delivered_customer_date
0,e481f51cbdc54678b7cc49136f2d6af7,delivered,2017-10-02 11:07:15,2017-10-04 19:55:00,2017-10-18 00:00:00,2017-10-10 21:25:13
1,53cdb2fc8bc7dce0b6741e2150273451,delivered,2018-07-26 03:24:27,2018-07-26 14:31:00,2018-08-13 00:00:00,2018-08-07 15:27:45
2,47770eb9100c2d0c44946d9cf07ec65d,delivered,2018-08-08 08:55:23,2018-08-08 13:50:00,2018-09-04 00:00:00,2018-08-17 18:06:29
3,949d5b44dbf5de918fe9c16f97b45f8a,delivered,2017-11-18 19:45:59,2017-11-22 13:39:59,2017-12-15 00:00:00,2017-12-02 00:28:42
4,ad21c59c0840e6cb83a9ceb5573f8159,delivered,2018-02-13 22:20:29,2018-02-14 19:46:34,2018-02-26 00:00:00,2018-02-16 18:17:02

In [65]:
delivery_t = delivery.drop_duplicates() #drop duplicate entries
delivery_t.shape

(99441, 6)

In [66]:
#Since order_id is the foreign key, we need to merge the delivery dataset with order dataset to get the intersection.
delivery_t = delivery_t.merge(order_new, left_on = delivery_t['order_id'], 
                          right_on = order_new['order_id'], 
                          how = 'inner')
delivery_t.head()

,order_id_x,order_status,order_approved_at,order_delivered_carrier_date,order_estimated_delivery_date,order_delivered_customer_date,order_id_y,customer_id,order_purchase_timestamp
0,e481f51cbdc54678b7cc49136f2d6af7,delivered,2017-10-02 11:07:15,2017-10-04 19:55:00,2017-10-18 00:00:00,2017-10-10 21:25:13,e481f51cbdc54678b7cc49136f2d6af7,9ef432eb6251297304e76186b10a928d,2017-10-02 10:56:33
1,47770eb9100c2d0c44946d9cf07ec65d,delivered,2018-08-08 08:55:23,2018-08-08 13:50:00,2018-09-04 00:00:00,2018-08-17 18:06:29,47770eb9100c2d0c44946d9cf07ec65d,41ce2a54c0b03bf3443c3d931a367089,2018-08-08 08:38:49
2,ad21c59c0840e6cb83a9ceb5573f8159,delivered,2018-02-13 22:20:29,2018-02-14 19:46:34,2018-02-26 00:00:00,2018-02-16 18:17:02,ad21c59c0840e6cb83a9ceb5573f8159,8ab97904e6daea8866dbdbc4fb7aad2c,2018-02-13 21:18:39
3,136cce7faa42fdb2cefd53fdc79a6098,invoiced,2017-04-13 13:25:17,NaN,2017-05-09 00:00:00,NaN,136cce7faa42fdb2cefd53fdc79a6098,ed0271e0b7da060a393796590e7b737a,2017-04-11 12:22:08
4,e69bfb5eb88e0ed6a785585b27e16dbf,delivered,2017-07-29 12:05:32,2017-08-10 19:45:24,2017-08-23 00:00:00,2017-08-16 17:14:30,e69bfb5eb88e0ed6a785585b27e16dbf,31ad1d1b63eb9962463f764d4e6e0c9d,2017-07-29 11:55:02

In [67]:
#drop unnecessary columns and reorder the dataset after merging
delivery_t = delivery_t[['order_id_x', 'order_status', 'order_approved_at', 'order_delivered_carrier_date', 
                   'order_estimated_delivery_date', 'order_delivered_customer_date']]
delivery_t.head()

,order_id_x,order_status,order_approved_at,order_delivered_carrier_date,order_estimated_delivery_date,order_delivered_customer_date
0,e481f51cbdc54678b7cc49136f2d6af7,delivered,2017-10-02 11:07:15,2017-10-04 19:55:00,2017-10-18 00:00:00,2017-10-10 21:25:13
1,47770eb9100c2d0c44946d9cf07ec65d,delivered,2018-08-08 08:55:23,2018-08-08 13:50:00,2018-09-04 00:00:00,2018-08-17 18:06:29
2,ad21c59c0840e6cb83a9ceb5573f8159,delivered,2018-02-13 22:20:29,2018-02-14 19:46:34,2018-02-26 00:00:00,2018-02-16 18:17:02
3,136cce7faa42fdb2cefd53fdc79a6098,invoiced,2017-04-13 13:25:17,NaN,2017-05-09 00:00:00,NaN
4,e69bfb5eb88e0ed6a785585b27e16dbf,delivered,2017-07-29 12:05:32,2017-08-10 19:45:24,2017-08-23 00:00:00,2017-08-16 17:14:30

In [68]:
#rename the columns
delivery_t.columns = ['order_id', 'order_status', 'order_approved_at', 'order_delivered_carrier_date', 
                   'order_estimated_delivery_date', 'order_delivered_customer_date']
delivery_t.head()

,order_id,order_status,order_approved_at,order_delivered_carrier_date,order_estimated_delivery_date,order_delivered_customer_date
0,e481f51cbdc54678b7cc49136f2d6af7,delivered,2017-10-02 11:07:15,2017-10-04 19:55:00,2017-10-18 00:00:00,2017-10-10 21:25:13
1,47770eb9100c2d0c44946d9cf07ec65d,delivered,2018-08-08 08:55:23,2018-08-08 13:50:00,2018-09-04 00:00:00,2018-08-17 18:06:29
2,ad21c59c0840e6cb83a9ceb5573f8159,delivered,2018-02-13 22:20:29,2018-02-14 19:46:34,2018-02-26 00:00:00,2018-02-16 18:17:02
3,136cce7faa42fdb2cefd53fdc79a6098,invoiced,2017-04-13 13:25:17,NaN,2017-05-09 00:00:00,NaN
4,e69bfb5eb88e0ed6a785585b27e16dbf,delivered,2017-07-29 12:05:32,2017-08-10 19:45:24,2017-08-23 00:00:00,2017-08-16 17:14:30

In [86]:
delivery_t.insert(0, 'delivery_id', range(1, 1+len(delivery_t))) #construct the delivery_id
delivery_t.head()

,delivery_id,order_id,order_status,order_approved_at,order_delivered_carrier_date,order_estimated_delivery_date,order_delivered_customer_date
0,1,e481f51cbdc54678b7cc49136f2d6af7,delivered,2017-10-02 11:07:15,2017-10-04 19:55:00,2017-10-18 00:00:00,2017-10-10 21:25:13
1,2,47770eb9100c2d0c44946d9cf07ec65d,delivered,2018-08-08 08:55:23,2018-08-08 13:50:00,2018-09-04 00:00:00,2018-08-17 18:06:29
2,3,ad21c59c0840e6cb83a9ceb5573f8159,delivered,2018-02-13 22:20:29,2018-02-14 19:46:34,2018-02-26 00:00:00,2018-02-16 18:17:02
3,4,136cce7faa42fdb2cefd53fdc79a6098,invoiced,2017-04-13 13:25:17,NaN,2017-05-09 00:00:00,NaN
4,5,e69bfb5eb88e0ed6a785585b27e16dbf,delivered,2017-07-29 12:05:32,2017-08-10 19:45:24,2017-08-23 00:00:00,2017-08-16 17:14:30

In [87]:
delivery_t.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 48688 entries, 0 to 48687
Data columns (total 7 columns):
delivery_id                      48688 non-null int64
order_id                         48688 non-null object
order_status                     48688 non-null object
order_approved_at                48683 non-null object
order_delivered_carrier_date     48184 non-null object
order_estimated_delivery_date    48688 non-null object
order_delivered_customer_date    47612 non-null object
dtypes: int64(1), object(6)
memory usage: 4.2+ MB

## Products_ordered

We also need to construct the products_ordered table specifying the order and product relationship by selecting the relavant columns from the order dataframe.

In [69]:
#selecting the variables from the order dataframe and save it as the products_ordered dataframe
products_ordered = order[['order_id_x', 'product_id', 'seller_id', 'price', 'freight_value']]
products_ordered.columns = ['order_id', 'product_id', 'seller_id', 'item_price', 'order_freight_value']
products_ordered.shape

(112650, 5)

In [70]:
products_ordered_df = products_ordered.drop_duplicates() #drop duplicated rows
len(products_ordered_df) #we find that there are duplicates

102425

In [71]:
len(products_ordered_df) == len(products_ordered_df[['order_id', 'product_id']].drop_duplicates())
#make sure that the composite primary key (product_id and order_id) include only unique values

True

In [72]:
products_ordered.head()

,order_id,product_id,seller_id,item_price,order_freight_value
0,00010242fe8c5a6d1ba2dd792cb16214,4244733e06e7ecb4970a6e2683c13e61,48436dade18ac8b2bce089ec2a041202,58.90,13.29
1,00018f77f2f0320c557190d7a144bdd3,e5f2d52b802189ee658865ca93d83a8f,dd7ddc04e1b6c2c614352b383efe2d36,239.90,19.93
2,000229ec398224ef6ca0657da4fc703e,c777355d18b72b67abbeef9df44fd0fd,5b51032eddd242adc84c38acab88f23d,199.00,17.87
3,00024acbcdf0a6daa1e931b038114c75,7634da152a4610f1595efa32f14722fc,9d7a1d34a5052409006425275ba1c2b4,12.99,12.79
4,00042b26cf59d7ce69dfabb4e55b4fd9,ac6c3623068f30de03045865e4e10089,df560393f3a51e74553ab94004ba5c87,199.90,18.14

In [73]:
#Since order_id is the foreign key, we need to merge the products_ordered dataset with order dataset to get the intersection.
pro_ordered_df = products_ordered.merge(order_new, left_on = products_ordered['order_id'], 
                          right_on = order_new['order_id'], 
                          how = 'inner')
pro_ordered_df.head()

,order_id_x,product_id,seller_id,item_price,order_freight_value,order_id_y,customer_id,order_purchase_timestamp
0,00018f77f2f0320c557190d7a144bdd3,e5f2d52b802189ee658865ca93d83a8f,dd7ddc04e1b6c2c614352b383efe2d36,239.90,19.93,00018f77f2f0320c557190d7a144bdd3,f6dd3ec061db4e3987629fe6b26e5cce,2017-04-26 10:53:06
1,000229ec398224ef6ca0657da4fc703e,c777355d18b72b67abbeef9df44fd0fd,5b51032eddd242adc84c38acab88f23d,199.00,17.87,000229ec398224ef6ca0657da4fc703e,6489ae5e4333f3693df5ad4372dab6d3,2018-01-14 14:33:31
2,00054e8431b9d7675808bcb819fb4a32,8d4f2bb7e93e6710a28f34fa83ee7d28,7040e82f899a04d1b434b795a43b4617,19.90,11.85,00054e8431b9d7675808bcb819fb4a32,32e2e6ab09e778d99bf2e0ecd4898718,2017-12-10 11:53:48
3,0005f50442cb953dcd1d21e1fb923495,4535b0e1091c278dfd193e5a1d63b39f,ba143b05f0110f0dc71ad71b4466ce92,53.99,11.40,0005f50442cb953dcd1d21e1fb923495,351d3cb2cee3c7fd0af6616c82df21d3,2018-07-02 13:59:39
4,00063b381e2406b52ad429470734ebd5,f177554ea93259a5b282f24e33f65ab6,8602a61d680a10a82cceeeda0d99ea3d,45.00,12.98,00063b381e2406b52ad429470734ebd5,6a899e55865de6549a58d2c6845e5604,2018-07-27 17:21:27

In [74]:
#drop unnecessary columns 
pro_ordered_df.drop(['order_id_y', 'customer_id','order_purchase_timestamp'], axis = 1, inplace = True)
pro_ordered_df.head()

,order_id_x,product_id,seller_id,item_price,order_freight_value
0,00018f77f2f0320c557190d7a144bdd3,e5f2d52b802189ee658865ca93d83a8f,dd7ddc04e1b6c2c614352b383efe2d36,239.90,19.93
1,000229ec398224ef6ca0657da4fc703e,c777355d18b72b67abbeef9df44fd0fd,5b51032eddd242adc84c38acab88f23d,199.00,17.87
2,00054e8431b9d7675808bcb819fb4a32,8d4f2bb7e93e6710a28f34fa83ee7d28,7040e82f899a04d1b434b795a43b4617,19.90,11.85
3,0005f50442cb953dcd1d21e1fb923495,4535b0e1091c278dfd193e5a1d63b39f,ba143b05f0110f0dc71ad71b4466ce92,53.99,11.40
4,00063b381e2406b52ad429470734ebd5,f177554ea93259a5b282f24e33f65ab6,8602a61d680a10a82cceeeda0d99ea3d,45.00,12.98

In [75]:
#rename the columns
pro_ordered_df.columns = ['order_id', 'product_id', 'seller_id', 'item_price', 'order_freight_value']
pro_ordered_df.head()

,order_id,product_id,seller_id,item_price,order_freight_value
0,00018f77f2f0320c557190d7a144bdd3,e5f2d52b802189ee658865ca93d83a8f,dd7ddc04e1b6c2c614352b383efe2d36,239.90,19.93
1,000229ec398224ef6ca0657da4fc703e,c777355d18b72b67abbeef9df44fd0fd,5b51032eddd242adc84c38acab88f23d,199.00,17.87
2,00054e8431b9d7675808bcb819fb4a32,8d4f2bb7e93e6710a28f34fa83ee7d28,7040e82f899a04d1b434b795a43b4617,19.90,11.85
3,0005f50442cb953dcd1d21e1fb923495,4535b0e1091c278dfd193e5a1d63b39f,ba143b05f0110f0dc71ad71b4466ce92,53.99,11.40
4,00063b381e2406b52ad429470734ebd5,f177554ea93259a5b282f24e33f65ab6,8602a61d680a10a82cceeeda0d99ea3d,45.00,12.98

In [76]:
#Since product_id is the foreign key, we need to merge the products_ordered dataset with order dataset to get the intersection.
pro_ordered_df_2 = pro_ordered_df.merge(products_df_2, left_on = pro_ordered_df['product_id'], 
                          right_on = products_df_2['product_id'], 
                          how = 'inner')
pro_ordered_df_2.head()

,order_id,product_id_x,seller_id,item_price,order_freight_value,product_id_y,product_name_length,product_description_length,product_photos_qty,product_category_id,product_weight,product_length,product_height,product_width
0,00018f77f2f0320c557190d7a144bdd3,e5f2d52b802189ee658865ca93d83a8f,dd7ddc04e1b6c2c614352b383efe2d36,239.90,19.93,e5f2d52b802189ee658865ca93d83a8f,56,239,2,30,30000.0,50.0,30.0,40.0
1,000229ec398224ef6ca0657da4fc703e,c777355d18b72b67abbeef9df44fd0fd,5b51032eddd242adc84c38acab88f23d,199.00,17.87,c777355d18b72b67abbeef9df44fd0fd,59,695,2,5,3050.0,33.0,13.0,33.0
2,00054e8431b9d7675808bcb819fb4a32,8d4f2bb7e93e6710a28f34fa83ee7d28,7040e82f899a04d1b434b795a43b4617,19.90,11.85,8d4f2bb7e93e6710a28f34fa83ee7d28,52,815,1,9,200.0,27.0,5.0,20.0
3,905bd749100612f28936959483361129,8d4f2bb7e93e6710a28f34fa83ee7d28,7040e82f899a04d1b434b795a43b4617,15.90,15.10,8d4f2bb7e93e6710a28f34fa83ee7d28,52,815,1,9,200.0,27.0,5.0,20.0
4,0005f50442cb953dcd1d21e1fb923495,4535b0e1091c278dfd193e5a1d63b39f,ba143b05f0110f0dc71ad71b4466ce92,53.99,11.40,4535b0e1091c278dfd193e5a1d63b39f,52,1192,1,40,850.0,29.0,3.0,21.0

In [77]:
#drop unnecessary columns 
pro_ordered_df_2 = pro_ordered_df_2[['order_id', 'product_id_x', 'seller_id', 'item_price', 'order_freight_value']]

pro_ordered_df_2.head()

,order_id,product_id_x,seller_id,item_price,order_freight_value
0,00018f77f2f0320c557190d7a144bdd3,e5f2d52b802189ee658865ca93d83a8f,dd7ddc04e1b6c2c614352b383efe2d36,239.90,19.93
1,000229ec398224ef6ca0657da4fc703e,c777355d18b72b67abbeef9df44fd0fd,5b51032eddd242adc84c38acab88f23d,199.00,17.87
2,00054e8431b9d7675808bcb819fb4a32,8d4f2bb7e93e6710a28f34fa83ee7d28,7040e82f899a04d1b434b795a43b4617,19.90,11.85
3,905bd749100612f28936959483361129,8d4f2bb7e93e6710a28f34fa83ee7d28,7040e82f899a04d1b434b795a43b4617,15.90,15.10
4,0005f50442cb953dcd1d21e1fb923495,4535b0e1091c278dfd193e5a1d63b39f,ba143b05f0110f0dc71ad71b4466ce92,53.99,11.40

In [78]:
#rename the columns
pro_ordered_df_2.columns = ['order_id', 'product_id', 'seller_id', 'item_price', 'order_freight_value']
pro_ordered_df_2.head()

,order_id,product_id,seller_id,item_price,order_freight_value
0,00018f77f2f0320c557190d7a144bdd3,e5f2d52b802189ee658865ca93d83a8f,dd7ddc04e1b6c2c614352b383efe2d36,239.90,19.93
1,000229ec398224ef6ca0657da4fc703e,c777355d18b72b67abbeef9df44fd0fd,5b51032eddd242adc84c38acab88f23d,199.00,17.87
2,00054e8431b9d7675808bcb819fb4a32,8d4f2bb7e93e6710a28f34fa83ee7d28,7040e82f899a04d1b434b795a43b4617,19.90,11.85
3,905bd749100612f28936959483361129,8d4f2bb7e93e6710a28f34fa83ee7d28,7040e82f899a04d1b434b795a43b4617,15.90,15.10
4,0005f50442cb953dcd1d21e1fb923495,4535b0e1091c278dfd193e5a1d63b39f,ba143b05f0110f0dc71ad71b4466ce92,53.99,11.40

In [79]:
#Since seller_id is the foreign key, we need to merge the product_ordered dataset with order dataset to get the intersection.
pro_ordered_df_3 = pro_ordered_df_2.merge(sellers_df, left_on = pro_ordered_df_2['seller_id'], 
                          right_on = sellers_df['seller_id'], 
                          how = 'inner')
pro_ordered_df_3.head()

,order_id,product_id,seller_id_x,item_price,order_freight_value,seller_id_y,geolocation_id
0,00018f77f2f0320c557190d7a144bdd3,e5f2d52b802189ee658865ca93d83a8f,dd7ddc04e1b6c2c614352b383efe2d36,239.9,19.93,dd7ddc04e1b6c2c614352b383efe2d36,10582
1,023669233121f0fb7899e5be2b22885f,4dba4de4cd67ba2191c34468ac2ca841,dd7ddc04e1b6c2c614352b383efe2d36,38.9,16.56,dd7ddc04e1b6c2c614352b383efe2d36,10582
2,0265de29d2bf47d85101018e7f7d4ff6,10876ffa7227a74d878729d3f6bea35d,dd7ddc04e1b6c2c614352b383efe2d36,45.9,31.95,dd7ddc04e1b6c2c614352b383efe2d36,10582
3,b7dc42271c71663ceed71350d60a5559,10876ffa7227a74d878729d3f6bea35d,dd7ddc04e1b6c2c614352b383efe2d36,45.9,19.84,dd7ddc04e1b6c2c614352b383efe2d36,10582
4,088683f795a3d30bfd61152c4fabdfb2,86742dc5c815f1c8c04c6e323e3c1865,dd7ddc04e1b6c2c614352b383efe2d36,29.9,16.92,dd7ddc04e1b6c2c614352b383efe2d36,10582

In [80]:
#drop unnecessary columns
pro_ordered_df_3 = pro_ordered_df_3[['order_id', 'product_id', 'seller_id_x', 'item_price', 'order_freight_value']]
pro_ordered_df_3.head()

,order_id,product_id,seller_id_x,item_price,order_freight_value
0,00018f77f2f0320c557190d7a144bdd3,e5f2d52b802189ee658865ca93d83a8f,dd7ddc04e1b6c2c614352b383efe2d36,239.9,19.93
1,023669233121f0fb7899e5be2b22885f,4dba4de4cd67ba2191c34468ac2ca841,dd7ddc04e1b6c2c614352b383efe2d36,38.9,16.56
2,0265de29d2bf47d85101018e7f7d4ff6,10876ffa7227a74d878729d3f6bea35d,dd7ddc04e1b6c2c614352b383efe2d36,45.9,31.95
3,b7dc42271c71663ceed71350d60a5559,10876ffa7227a74d878729d3f6bea35d,dd7ddc04e1b6c2c614352b383efe2d36,45.9,19.84
4,088683f795a3d30bfd61152c4fabdfb2,86742dc5c815f1c8c04c6e323e3c1865,dd7ddc04e1b6c2c614352b383efe2d36,29.9,16.92

In [81]:
#rename the columns
pro_ordered_df_3.columns = ['order_id', 'product_id', 'seller_id', 'item_price', 'order_freight_value']
pro_ordered_df_3.head()

,order_id,product_id,seller_id,item_price,order_freight_value
0,00018f77f2f0320c557190d7a144bdd3,e5f2d52b802189ee658865ca93d83a8f,dd7ddc04e1b6c2c614352b383efe2d36,239.9,19.93
1,023669233121f0fb7899e5be2b22885f,4dba4de4cd67ba2191c34468ac2ca841,dd7ddc04e1b6c2c614352b383efe2d36,38.9,16.56
2,0265de29d2bf47d85101018e7f7d4ff6,10876ffa7227a74d878729d3f6bea35d,dd7ddc04e1b6c2c614352b383efe2d36,45.9,31.95
3,b7dc42271c71663ceed71350d60a5559,10876ffa7227a74d878729d3f6bea35d,dd7ddc04e1b6c2c614352b383efe2d36,45.9,19.84
4,088683f795a3d30bfd61152c4fabdfb2,86742dc5c815f1c8c04c6e323e3c1865,dd7ddc04e1b6c2c614352b383efe2d36,29.9,16.92

In [82]:
pro_ordered_df_3 = pro_ordered_df_3.drop_duplicates() #drop duplicate entries

In [83]:
len(pro_ordered_df_3) == len(pro_ordered_df_3[['order_id', 'product_id']].drop_duplicates()) 
#make sure the composite primary key (order_id, product_id) contains only unique value

True

In [79]:
#load the products_ordered
pro_ordered_df_3.to_sql(name='products_ordered', con=engine, if_exists='append', index=False)

After loading the order and products_ordered tables, we need to load the delivery table into sql database.

In [88]:
#After loading the products_ordered table, then upload the delivery table
delivery_t.to_sql(name='delivery', con=engine, if_exists='append', index=False)

## Reviews

In [44]:
reviews.head()

,review_id,order_id,review_score,review_comment_title,review_comment_message,review_creation_date,review_answer_timestamp
0,7bc2406110b926393aa56f80a40eba40,73fc7af87114b39712e6da79b0a377eb,4,NaN,NaN,2018-01-18 00:00:00,2018-01-18 21:46:59
1,80e641a11e56f04c1ad469d5645fdfde,a548910a1c6147796b98fdf73dbeba33,5,NaN,NaN,2018-03-10 00:00:00,2018-03-11 03:05:13
2,228ce5500dc1d8e020d8d1322874b6f0,f9e4b658b201a9f2ecdecbb34bed034b,5,NaN,NaN,2018-02-17 00:00:00,2018-02-18 14:36:24
3,e64fb393e7b32834bb789ff8bb30750e,658677c97b385a9be170737859d3511b,5,NaN,Recebi bem antes do prazo estipulado.,2017-04-21 00:00:00,2017-04-21 22:02:06
4,f7c4243c7fe1938f181bec41a392bdeb,8e6bfb81e283fa7e4f11123a3fb894f1,5,NaN,Parabéns lojas lannister adorei comprar pela I...,2018-03-01 00:00:00,2018-03-02 10:26:53

In [45]:
#pick the columns
reviews = reviews[['review_id','order_id','review_score','review_comment_title',
                   'review_comment_message','review_creation_date','review_answer_timestamp']]
reviews.head()

,review_id,order_id,review_score,review_comment_title,review_comment_message,review_creation_date,review_answer_timestamp
0,7bc2406110b926393aa56f80a40eba40,73fc7af87114b39712e6da79b0a377eb,4,NaN,NaN,2018-01-18 00:00:00,2018-01-18 21:46:59
1,80e641a11e56f04c1ad469d5645fdfde,a548910a1c6147796b98fdf73dbeba33,5,NaN,NaN,2018-03-10 00:00:00,2018-03-11 03:05:13
2,228ce5500dc1d8e020d8d1322874b6f0,f9e4b658b201a9f2ecdecbb34bed034b,5,NaN,NaN,2018-02-17 00:00:00,2018-02-18 14:36:24
3,e64fb393e7b32834bb789ff8bb30750e,658677c97b385a9be170737859d3511b,5,NaN,Recebi bem antes do prazo estipulado.,2017-04-21 00:00:00,2017-04-21 22:02:06
4,f7c4243c7fe1938f181bec41a392bdeb,8e6bfb81e283fa7e4f11123a3fb894f1,5,NaN,Parabéns lojas lannister adorei comprar pela I...,2018-03-01 00:00:00,2018-03-02 10:26:53

In [46]:
#Since order_id is the foreign key, we need to merge the reviews dataset with order dataset to get the intersection.
reviews_df = reviews.merge(order_new, left_on = reviews['order_id'], 
                          right_on = order_new['order_id'], 
                          how = 'inner')
reviews_df.head()

,review_id,order_id_x,review_score,review_comment_title,review_comment_message,review_creation_date,review_answer_timestamp,order_id_y,customer_id,order_purchase_timestamp
0,228ce5500dc1d8e020d8d1322874b6f0,f9e4b658b201a9f2ecdecbb34bed034b,5,NaN,NaN,2018-02-17 00:00:00,2018-02-18 14:36:24,f9e4b658b201a9f2ecdecbb34bed034b,e226dfed6544df5b7b87a48208690feb,2018-02-03 09:56:22
1,07f9bee5d1b850860defd761afa7ff16,e48aa0d2dcec3a2e87348811bcfdf22b,5,NaN,NaN,2017-07-16 00:00:00,2017-07-18 19:30:34,e48aa0d2dcec3a2e87348811bcfdf22b,840be0730010e9580efd289bc9f37706,2017-06-30 15:38:46
2,c9cfd2d5ab5911836ababae136c3a10c,cdf9aa68e72324eeb25c7de974696ee2,5,NaN,NaN,2017-12-23 00:00:00,2017-12-26 14:36:03,cdf9aa68e72324eeb25c7de974696ee2,272b46feddddc51904608ddd90feee33,2017-12-13 14:59:45
3,4b49719c8a200003f700d3d986ea1a19,9d6f15f95d01e79bd1349cc208361f09,4,NaN,"Mas um pouco ,travando...pelo valor ta Boa.\r\n",2018-02-16 00:00:00,2018-02-20 10:52:22,9d6f15f95d01e79bd1349cc208361f09,8ebbeb09e94d1e789142983f73faa9cd,2018-02-12 16:07:34
4,23f75a37effc35d9a915b4e1ad483793,2eaf8e099d871cd5c22b83b5ea8f6e0e,4,NaN,NaN,2018-03-28 00:00:00,2018-03-30 15:10:55,2eaf8e099d871cd5c22b83b5ea8f6e0e,9d53af6298240d4573ca6e52bcfa6c63,2018-03-21 11:22:23

In [47]:
#drop unnecessary columns
reviews_df = reviews_df[['review_id', 'order_id_x', 'review_score', 'review_comment_title', 
                         'review_comment_message', 'review_creation_date', 'review_answer_timestamp']]
reviews_df.head()

,review_id,order_id_x,review_score,review_comment_title,review_comment_message,review_creation_date,review_answer_timestamp
0,228ce5500dc1d8e020d8d1322874b6f0,f9e4b658b201a9f2ecdecbb34bed034b,5,NaN,NaN,2018-02-17 00:00:00,2018-02-18 14:36:24
1,07f9bee5d1b850860defd761afa7ff16,e48aa0d2dcec3a2e87348811bcfdf22b,5,NaN,NaN,2017-07-16 00:00:00,2017-07-18 19:30:34
2,c9cfd2d5ab5911836ababae136c3a10c,cdf9aa68e72324eeb25c7de974696ee2,5,NaN,NaN,2017-12-23 00:00:00,2017-12-26 14:36:03
3,4b49719c8a200003f700d3d986ea1a19,9d6f15f95d01e79bd1349cc208361f09,4,NaN,"Mas um pouco ,travando...pelo valor ta Boa.\r\n",2018-02-16 00:00:00,2018-02-20 10:52:22
4,23f75a37effc35d9a915b4e1ad483793,2eaf8e099d871cd5c22b83b5ea8f6e0e,4,NaN,NaN,2018-03-28 00:00:00,2018-03-30 15:10:55

In [48]:
#rename the columns
reviews_df.columns = ['review_id', 'order_id', 'review_score', 'review_comment_title', 
                         'review_comment_message', 'review_creation_date', 'review_answer_timestamp']
reviews_df.head()

,review_id,order_id,review_score,review_comment_title,review_comment_message,review_creation_date,review_answer_timestamp
0,228ce5500dc1d8e020d8d1322874b6f0,f9e4b658b201a9f2ecdecbb34bed034b,5,NaN,NaN,2018-02-17 00:00:00,2018-02-18 14:36:24
1,07f9bee5d1b850860defd761afa7ff16,e48aa0d2dcec3a2e87348811bcfdf22b,5,NaN,NaN,2017-07-16 00:00:00,2017-07-18 19:30:34
2,c9cfd2d5ab5911836ababae136c3a10c,cdf9aa68e72324eeb25c7de974696ee2,5,NaN,NaN,2017-12-23 00:00:00,2017-12-26 14:36:03
3,4b49719c8a200003f700d3d986ea1a19,9d6f15f95d01e79bd1349cc208361f09,4,NaN,"Mas um pouco ,travando...pelo valor ta Boa.\r\n",2018-02-16 00:00:00,2018-02-20 10:52:22
4,23f75a37effc35d9a915b4e1ad483793,2eaf8e099d871cd5c22b83b5ea8f6e0e,4,NaN,NaN,2018-03-28 00:00:00,2018-03-30 15:10:55

In [49]:
reviews_df[reviews_df['review_id'] == '3242cc306a9218d0377831e175d62fbf']

Empty DataFrame
Columns: [review_id, order_id, review_score, review_comment_title, review_comment_message, review_creation_date, review_answer_timestamp]
Index: []

In [50]:
len(reviews_df)==len(reviews_df[['review_id', 'order_id']].drop_duplicates()) 
#make sure the composite primary key (review_id, order_id) contains only unique value

True

In [51]:
reviews_df.to_sql(name='reviews', con=engine, if_exists='append', index=False)

## Payment

In [52]:
payments.head()

,order_id,payment_sequential,payment_type,payment_installments,payment_value
0,b81ef226f3fe1789b1e8b2acac839d17,1,credit_card,8,99.33
1,a9810da82917af2d9aefd1278f1dcfa0,1,credit_card,1,24.39
2,25e8ea4e93396b6fa0d3dd708e76c1bd,1,credit_card,1,65.71
3,ba78997921bbcdc1373bb41e913ab953,1,credit_card,8,107.78
4,42fdf880ba16b47b59251dd489d4441a,1,credit_card,2,128.45

In [53]:
payments.shape

(103886, 5)

In [54]:
payment = payments.drop_duplicates() #drop duplicates and check the dataframe
payment.shape

(103886, 5)

In [55]:
#Since order_id is the foreign key, we need to merge the payment dataset with order dataset to get the intersection.
payment_df = payment.merge(order_new, left_on = payment['order_id'], 
                          right_on = order_new['order_id'], 
                          how = 'inner')
payment_df.head()

,order_id_x,payment_sequential,payment_type,payment_installments,payment_value,order_id_y,customer_id,order_purchase_timestamp
0,b81ef226f3fe1789b1e8b2acac839d17,1,credit_card,8,99.33,b81ef226f3fe1789b1e8b2acac839d17,0a8556ac6be836b46b3e89920d59291c,2018-04-25 22:01:49
1,a9810da82917af2d9aefd1278f1dcfa0,1,credit_card,1,24.39,a9810da82917af2d9aefd1278f1dcfa0,f2c7fc58a9de810828715166c672f10a,2018-06-26 11:01:38
2,298fcdf1f73eb413e4d26d01b25bc1cd,1,credit_card,2,96.12,298fcdf1f73eb413e4d26d01b25bc1cd,a24e6f72471e9dbafcb292bc318f4859,2018-05-07 13:20:41
3,771ee386b001f06208a7419e4fc1bbd7,1,credit_card,1,81.16,771ee386b001f06208a7419e4fc1bbd7,206c0fcc717333d169ff95933fb47341,2017-06-23 13:11:27
4,0573b5e23cbd798006520e1d5b4c6714,1,boleto,1,51.95,0573b5e23cbd798006520e1d5b4c6714,c4e17eff78176dfe3401f03db0346f85,2017-07-04 20:32:10

In [56]:
payment_df = payment_df[['order_id_x', 'payment_sequential', 'payment_type', 
                         'payment_installments', 'payment_value']] #drop unnecessary columns
payment_df.head()

,order_id_x,payment_sequential,payment_type,payment_installments,payment_value
0,b81ef226f3fe1789b1e8b2acac839d17,1,credit_card,8,99.33
1,a9810da82917af2d9aefd1278f1dcfa0,1,credit_card,1,24.39
2,298fcdf1f73eb413e4d26d01b25bc1cd,1,credit_card,2,96.12
3,771ee386b001f06208a7419e4fc1bbd7,1,credit_card,1,81.16
4,0573b5e23cbd798006520e1d5b4c6714,1,boleto,1,51.95

In [57]:
payment_df.columns = ['order_id', 'payment_sequential', 'payment_type', 
                         'payment_installments', 'payment_value'] #rename the columns
payment_df.head()

,order_id,payment_sequential,payment_type,payment_installments,payment_value
0,b81ef226f3fe1789b1e8b2acac839d17,1,credit_card,8,99.33
1,a9810da82917af2d9aefd1278f1dcfa0,1,credit_card,1,24.39
2,298fcdf1f73eb413e4d26d01b25bc1cd,1,credit_card,2,96.12
3,771ee386b001f06208a7419e4fc1bbd7,1,credit_card,1,81.16
4,0573b5e23cbd798006520e1d5b4c6714,1,boleto,1,51.95

In [58]:
#change the order of the columns
payment_df = payment_df[['order_id', 'payment_installments', 'payment_sequential','payment_type', 'payment_value']]
#construct the payment_id
payment_df.insert(0, 'payment_id', range(1, 1+len(payment_df)))
#check the dataframe
payment_df.head()

,payment_id,order_id,payment_installments,payment_sequential,payment_type,payment_value
0,1,b81ef226f3fe1789b1e8b2acac839d17,8,1,credit_card,99.33
1,2,a9810da82917af2d9aefd1278f1dcfa0,1,1,credit_card,24.39
2,3,298fcdf1f73eb413e4d26d01b25bc1cd,2,1,credit_card,96.12
3,4,771ee386b001f06208a7419e4fc1bbd7,1,1,credit_card,81.16
4,5,0573b5e23cbd798006520e1d5b4c6714,1,1,boleto,51.95

In [59]:
#rename the columns
payment_df.columns = ['payment_id','order_id',
                    'installments','sequential',
                    'payment_type', 'transaction_value']
payment_df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 50802 entries, 0 to 50801
Data columns (total 6 columns):
payment_id           50802 non-null int64
order_id             50802 non-null object
installments         50802 non-null int64
sequential           50802 non-null int64
payment_type         50802 non-null object
transaction_value    50802 non-null float64
dtypes: float64(1), int64(3), object(2)
memory usage: 2.7+ MB

In [60]:
len(payment_df) == len(payment_df['payment_id'].unique())
#make sure the primary key payment_id contains only unique value

True

In [61]:
payment_df.to_sql(name='payment', con=engine, if_exists='append', index=False)